app/Http/Controllers/Frontend/AuthController.php

    public function activate($token = null)
    {
        if ($token === null) {
            return redirect('/');
        }
        $user = User::where('email_verification_token', $token)->firstOrFail();

        if ($user) {
            $user->update([
                'email_verified_at' => Carbon::now(),
                'email_verification_token' => null,
            ]);
---
select * from `users` where `email_verification_token` = '15493125795c58a2433af2f5.21409086A6NVtl5pwapuvonS' limit 1
update `users` set `email_verified_at` = '2019-02-05 02:37:32', `email_verification_token` = '', `updated_at` = '2019-02-05 02:37:32' where `id` = 11