app/Http/Controllers/Frontend/CartController.php

select * from `orders` where `orders`.`id` = '7' limit 1
select * from `products` where `products`.`id` in (1)
---
    public function showOrderDetails($id)
    {
        $data = [];
        $data['cart'] = session()->has('cart') ? session()->get('cart') : [];
        $data['order'] = Order::with(['products','products.product'])->findOrFail($id);