app/Http/Controllers/Frontend/HomeController.php

select `id`, `title`, `slug`, `price`, `sale_price` from `products` where `active` = 1 limit 9 offset 0
select count(*) as aggregate from `products` where `active` = 1
---
    public function showHomePage()
    {
        $data = [];
        $data['products'] = Product::select(['id','title', 'slug', 'price', 'sale_price'])
            ->where('active', 1)
            ->paginate(9);